Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: A Draw Task carries the following information:
it_it: Un Draw Task contiene le seguenti informazioni:

source: A Git repository is available that includes everything needed to test the Buildroot setup without following the guide.
it_it: È disponibile un repository Git che include tutto il necessario per testare la configurazione di Buildroot senza seguire la guida.

source: A Label is the Widget used to display text.
it_it: Una "Label" [etichetta] è il Widget utilizzato per visualizzare il testo.

source: A Line's points have to be stored in an :cpp:struct:`lv_point_precise_t` array and passed to the Widget by the :cpp:expr:`lv_line_set_points(lines, point_array, point_cnt)` function.
it_it: I punti di una linea devono essere memorizzati in un array :cpp:struct:`lv_point_precise_t` e passati al Widget tramite la funzione :cpp:expr:`lv_line_set_points(lines, point_array, point_cnt)`.

source: A Linux path to the Alif SE Tools may look something like ``"/home/you/app-release-exec-linux"``.
it_it: Un path Linux per i Tool Alif SE potrebbe essere simile a ``"/home/you/app-release-exec-linux"``.

source: A Linux system with DRM/KMS support enabled in the kernel.
it_it: Un sistema Linux con supporto DRM/KMS abilitato nel kernel.

source: A PR is a notification like "Hey, I made some updates to your project.
it_it: Una PR è una notifica del tipo "Ehi, ho apportato degli aggiornamenti al progetto.

source: A RTOS is required to block the LVGL drawing thread and switch to another task or suspend the CPU for power savings.
it_it: È necessario un RTOS per bloccare il thread di disegno LVGL e passare a un altro task o sospendere la CPU per risparmiare energia.

source: A Scale starts its life with a default numeric range of [0..100] and a default angular range of 270.
it_it: Una "Scale" inizia la sua vita con un intervallo numerico predefinito di [0..100] e un intervallo angolare predefinito di 270.

source: A Screen is considered "being loaded" until the loading animation finishes.
it_it: Uno Screen è considerato "in fase di caricamento" fino al termine dell'animazione di caricamento.

source: A Scrollbar is a dedicated part of a Widget, called :cpp:enumerator:`LV_PART_SCROLLBAR`.
it_it: Una "Scrollbar" [barra di scorrimento] è una parte dedicata di un widget, chiamata :cpp:enumerator:`LV_PART_SCROLLBAR`.

source: A Section is created using :cpp:expr:`lv_scale_add_section(scale)`, which returns a pointer to a :cpp:type:`lv_scale_section_t` object.
it_it: Una sezione viene creata utilizzando :cpp:expr:`lv_scale_add_section(scale)`, che restituisce un puntatore a un oggetto :cpp:type:`lv_scale_section_t`.

source: A Section represents a sub-range of the Scale, whose Styles (like Cascading Style Sheets) take precedence while drawing the PARTS (lines, arcs, ticks and labels) of the Scale that are within the range of that Section.
it_it: Una Sezione rappresenta un sottointervallo della "Scale", i cui Stili (come i Cascading Style Sheets) hanno la precedenza durante il disegno delle PARTI (linee, archi, tacche ed etichette) della "Scale" che rientrano nell'intervallo di quella Sezione.

source: A Slider widget, for example, uses these features to realize slider-like behavior, but it’s all based on the same style, event, layout, and other concepts supported by the Base Widget.
it_it: Un widget Slider, ad esempio, utilizza queste funzionalità per realizzare un comportamento simile a quello di uno slider, ma si basa sullo stesso stile, evento, layout e altri concetti supportati dal Widget Base.

source: A Spangroup can be set to handle text overflow in one of the following ways:
it_it: Uno Spangroup può essere impostato per gestire l'overflow del testo in uno dei seguenti modi:

source: A Spangroup can be set to one the following modes:
it_it: Uno Spangroup può essere impostato su una delle seguenti modalità:

source: A Spangroup contains 0 or more Span Descriptors ("Spans").
it_it: Uno Spangroup contiene 0 o più Descrittori Span.

source: A Subject and its Observers can be used in various ways:
it_it: Un Subject e i suoi Observer possono essere utilizzati in vari modi:

source: A Theme is a collection of styles with the knowledge of which subset of styles are applied to which types of Widgets.
it_it: Un Tema è una raccolta di stili con la consapevolezza di quale sottoinsieme di stili viene applicato a quali tipi di Widget.

source: A Timeline is a collection of multiple Animations which makes it easy to create complex composite Animations.
it_it: Una Timeline è una raccolta di più animazioni che semplifica la creazione di Animazioni composite complesse.

source: A Timer callback should have this prototype: ``void (*lv_timer_cb_t)(lv_timer_t *)``.
it_it: Una callback del Timer dovrebbe avere questo prototipo: ``void (*lv_timer_cb_t)(lv_timer_t *)``.

source: A TorizonOS guide to develop an application using LVGL can be found in the :ref:`torizon-os-section` section.
it_it: Una guida di TorizonOS per sviluppare un'applicazione utilizzando LVGL è disponibile nella sezione :ref:`torizon-os-section`.

source: A Widget XML processor can be registered as follows:
it_it: Un processore XML per Widget può essere registrato come segue:

source: A Widget can align snapped children in four ways:
it_it: Un Widget può allineare i figli agganciati in quattro modi:

source: A Widget can be in a combination of states such as being focused and pressed at the same time.
it_it: Un Widget può trovarsi in una combinazione di stati, ad esempio essere attivo e premuto contemporaneamente.

source: A Widget goes to the :cpp:enumerator:`LV_STATE_SCROLLED` state while it's being scrolled.
it_it: Un Widget passa allo stato :cpp:enumerator:`LV_STATE_SCROLLED` durante lo scorrimento.

source: A Widget is the **basic building block** of the LVGL user interface.
it_it: Un Widget è l'**elemento costitutivo di base** dell'interfaccia utente LVGL.

source: A Widget needs to be clickable or click focusable (:cpp:enumerator:`LV_OBJ_FLAG_CLICKABLE` or :cpp:enumerator:`LV_OBJ_FLAG_CLICK_FOCUSABLE`) and not hidden (:cpp:enumerator:`LV_OBJ_FLAG_HIDDEN`) to receive focus via gridnav.
it_it: Un widget deve essere cliccabile o con focus cliccabile (:cpp:enumerator:`LV_OBJ_FLAG_CLICKABLE` o :cpp:enumerator:`LV_OBJ_FLAG_CLICK_FOCUSABLE`) e non nascosto (:cpp:enumerator:`LV_OBJ_FLAG_HIDDEN`) per ricevere il focus tramite gridnav.

source: A Widget's :ref:`local styles <style_local>` are also valid properties in this context.
it_it: Anche gli :ref:`stili locali <style_local>` di un Widget sono proprietà valide in questo contesto.

source: A Widget's properties are the combined set of :ref:`styles` plus additional properties that are unique to each type of Widget, that determine what the Widget looks like and how it behaves.
it_it: Le proprietà di un Widget sono l'insieme combinato di :ref:`styles` più ulteriori proprietà, uniche per ogni tipo di Widget, che determinano l'aspetto e il comportamento del Widget.

source: A ``.tar.gz`` is generated in output/images.
it_it: Viene generato un file ``.tar.gz`` in output/images.

source: A ``settings.json`` will open.
it_it: Si aprirà un file ``settings.json``.

source: A bitmap font provides the solution, but it's necessary to convert the bitmap font (BDF) to a TTF.
it_it: Un font bitmap offre la soluzione, ma è necessario convertire il font bitmap (BDF) in un TTF.

source: A block cursor can be created by adding a background color and background opacity to :cpp:enumerator:`LV_PART_CURSOR`\ 's style.
it_it: È possibile creare un cursore a blocco aggiungendo un colore di sfondo e un'opacità di sfondo allo stile di :cpp:enumerator:`LV_PART_CURSOR`\ '.

source: A board with a display is much easier to get started with if the LCD is already configured in the ``.ioc`` file.
it_it: È molto più facile iniziare a utilizzare una board con un display se il display LCD è già configurato nel file ``.ioc`` .

source: A button with a label and react on click event
it_it: Un pulsante con un'etichetta e un evento di reazione al clic

source: A callback is assigned like this:
it_it: Una callback viene assegnata in questo modo:

source: A chart can be one of the following types:
it_it: Un "chart" [grafico] può essere di uno dei seguenti tipi:

source: A click streak refers to multiple short clicks within a short period of time and a small distance.
it_it: Una serie di clic si riferisce a più clic brevi in un breve periodo di tempo e a una distanza ridotta.

source: A color can be mixed with every pixel of an image with a given intensity.
it_it: Un colore può essere miscelato con ogni pixel di un'immagine con una determinata intensità.

source: A color format conversion can be saved during rendering if the color format matches the display color format.
it_it: È possibile salvare una conversione del formato colore durante il rendering corrisponde al formato colore visualizzato.

source: A color stored as 24-bit RGB (:cpp:expr:`lv_color_t`).
it_it: Un colore memorizzato come RGB a 24 bit (:cpp:expr:`lv_color_t`).

source: A component having many packages with the same PV usually means that the packages all install the same upstream version, but with later (PR) version packages including packaging fixes.
it_it: Un componente con molti pacchetti con lo stesso PV di solito significa che tutti i pacchetti installano la stessa versione upstream, ma con pacchetti di versioni successive (PR) che includono correzioni al packaging.

source: A comprehensive mapping of LVGL in Berry language is now available, similar to the mapping of MicroPython.
it_it: È ora disponibile una mappatura completa di LVGL nel linguaggio Berry, simile a quella di MicroPython.

source: A copy of the frogfs source is inside LVGL.
it_it: Una copia del codice sorgente di frogfs si trova all'interno di LVGL.

source: A copy of the passed pointer can be retrieved by calling :cpp:expr:`lv_observer_get_target(observer)`, e.g. inside the callback function.
it_it: Una copia del puntatore passato può essere recuperata chiamando :cpp:expr:`lv_observer_get_target(observer)`, ad esempio all'interno della funzione di callback.

source: A copy of the pointer to that Widget is saved in the Observer's ``target`` field.
it_it: Una copia del puntatore a quel Widget viene salvata nel campo ``target``.

source: A copy of the pointer to the Widget can be retrieved by calling :cpp:expr:`lv_observer_get_target_obj(observer)`, e.g. inside the callback function.
it_it: Una copia del puntatore al Widget può essere recuperata chiamando :cpp:expr:`lv_observer_get_target_obj(observer)`, ad esempio all'interno della funzione di callback.

source: A cursor can be added with ``lv_chart_cursor_t * c1 = lv_chart_add_cursor(chart, color, dir);``.
it_it: È possibile aggiungere un cursore con ``lv_chart_cursor_t * c1 = lv_chart_add_cursor(chart, color, dir);``.

source: A custom API can be defined
it_it: È possibile definire un'API personalizzata

source: A custom XML parser is needed to map XML properties to API function calls.
it_it: È necessario un parser XML personalizzato per mappare le proprietà XML alle chiamate alle funzioni API.

source: A custom name can be assigned using :cpp:expr:`lv_obj_set_name(obj, "name")` or :cpp:expr:`lv_obj_set_name_static(obj, "name")`.
it_it: È possibile assegnare un nome personalizzato utilizzando :cpp:expr:`lv_obj_set_name(obj, "name")` o :cpp:expr:`lv_obj_set_name_static(obj, "name")`.

source: A different form of the same letter needs to be used when it is isolated, at start, middle or end positions.
it_it: È necessario utilizzare una forma diversa della stessa lettera quando è isolata, all'inizio, al centro o alla fine.

source: A display can have multiple screens, but there is always one active screen, which can be retrieved by using :cpp:expr:`lv_screen_active()`.
it_it: Un display può avere più screen, ma ce n'è sempre uno solo attivo, che può essere recuperato tramite :cpp:expr:`lv_screen_active()`.

source: A few hundred files will be compiled.
it_it: Verranno compilate alcune centinaia di file.

source: A file called ``file_list_gen.cmake`` is generated and used by ``CMakeLists.txt``.
it_it: Viene generato un file chiamato ``file_list_gen.cmake`` che viene utilizzato da ``CMakeLists.txt``.

source: A file system driver needs to be registered to open images from files.
it_it: Per aprire le immagini dai file, è necessario registrare un driver del file system.

source: A file system is identified by an assigned identifier letter.
it_it: Un file system è identificato da una lettera identificativa assegnata.

source: A font engine is some C code that allows LVGL to extract various information from the fonts, such as character (glyph) information or bitmap.
it_it: Un "font engine" è un codice C che consente a LVGL di estrarre varie informazioni dai font, come informazioni sui caratteri (glifi) o bitmap.

source: A font is stored in a :cpp:type:`lv_font_t` variable and can be set in a style's *text_font* field.
it_it: Un font è memorizzato in una variabile :cpp:type:`lv_font_t` e può essere impostato nel campo *text_font* di uno stile.

source: A fragment defines and manages its own layout, has its own lifecycle, and can handle its own events.
it_it: Un frammento definisce e gestisce il proprio layout, ha un proprio ciclo di vita e può gestire i propri eventi.

source: A free and open-source version is available `here <https://llvm-gcc-renesas.com/rx-download-toolchains/>`__ after registration.
it_it: Una versione gratuita e open source è disponibile `qui <https://llvm-gcc-renesas.com/rx-download-toolchains/>`__ dopo la registrazione.

source: A friendly and helpful community is waiting for you.
it_it: Una community amichevole e disponibile ed in attesa.

source: A good value to delay for is ``2`` ms.
it_it: Un buon valore per il ritardo è ``2`` ms.

source: A gradient is basically a transition of colors and opacities between stops.
it_it: Un gradiente è fondamentalmente una transizione di colori e opacità tra gli stop.

source: A greater value means faster slow-down.
it_it: Un valore maggiore indica un rallentamento più rapido.

source: A high percentage LVGL functions (functions that start with ``lv_``) either read from or change those data structures.
it_it: Un'alta percentuale di funzioni LVGL (funzioni che iniziano con ``lv_``) leggono o modificano tali strutture dati.

source: A higher level interface compatible with `OpenHASP <https://github.com/HASwitchPlate/openHASP>`__ is also under development.
it_it: È in fase di sviluppo anche un'interfaccia di livello superiore compatibile con `OpenHASP <https://github.com/HASwitchPlate/openHASP>`__.

source: A higher value means higher precedence.
it_it: Un valore più alto significa una precedenza più alta.

source: A horizontal scale with labels rotated and translated
it_it: Una scala orizzontale con etichette ruotate e traslate

source: A key/value pair has been added to each object (key = "json_type") to make it possible to pass an object to a generic function and have each object know its own type through this field.
it_it: A ciascun oggetto è stata aggiunta una coppia chiave/valore (chiave = "json_type") per consentire il passaggio di un oggetto a una funzione generica e far sì che ciascun oggetto conosca il proprio tipo tramite questo campo.

source: A keypad
it_it: Una tastiera

source: A larger buffer can reduce the frequency of log flushing, but it also consumes more memory.
it_it: Un buffer più grande può ridurre la frequenza di flushing [svuotamento] dei log, ma consuma anche più memoria.

source: A larger buffer can store more trace event information, reducing interference with rendering.
it_it: Un buffer più grande può memorizzare più informazioni sugli eventi di tracing, riducendo l'interferenza con il rendering.

source: A larger value enlarges the images (e.g. ``512`` double size), a smaller value shrinks it (e.g. ``128`` half size).
it_it: Un valore maggiore ingrandisce le immagini (ad esempio ``512`` ne raddoppia le dimensioni), un valore minore le rimpicciolisce (ad esempio ``128`` ne dimezza le dimensioni).

source: A list of terms and definitions users new to the Yocto Project development environment might find helpful can be found `here <https://docs.
it_it: Un elenco di termini e definizioni che gli utenti alle prime armi con l'ambiente di sviluppo del progetto Yocto potrebbero trovare utili è disponibile `qui <https://docs.

source: A list of the most commonly-used special symbols can be found in ./docs/src/include/substitutions.txt.
it_it: Un elenco dei simboli speciali più comunemente utilizzati è disponibile in ./docs/src/include/substitutions.txt.

source: A minimal example:
it_it: Un esempio minimo:

source: A minimal framebuffer driver for EVE FT81x smart display controllers.
it_it: Un driver framebuffer minimale per i controller smart display EVE FT81x.

source: A more complete variable glossary can be found in `Yocto Variable Glossary <https://docs.yoctoproject.org/ref-manual/variables.html>`_.
it_it: Un glossario più completo delle variabili è disponibile nel `Glossario delle variabili Yocto <https://docs.yoctoproject.org/ref-manual/variables.html>`_.

source: A negative value indicates no limit.
it_it: Un valore negativo indica nessun limite.

source: A new cursor is initially given position :c:macro:`LV_CHART_POINT_NONE` which causes it to be hidden.
it_it: Inizialmente, a un nuovo cursore viene assegnata la posizione :c:macro:`LV_CHART_POINT_NONE`, che lo nasconde.

source: A new folder ``image`` was created.
it_it: È stata creata una nuova cartella ``image``.

source: A new tab can be selected either by clicking on a tab button or by sliding horizontally on the content.
it_it: È possibile selezionare una nuova scheda cliccando su un pulsante scheda o scorrendo orizzontalmente sul contenuto.

source: A new value can be set using :cpp:expr:`lv_arc_set_value(arc, new_value)`.
it_it: È possibile impostare un nuovo valore utilizzando :cpp:expr:`lv_arc_set_value(arc, new_value)`.

source: A new value can be set with :cpp:expr:`lv_bar_set_value(bar, new_value, LV_ANIM_ON/OFF)`.
it_it: È possibile impostare un nuovo valore con :cpp:expr:`lv_bar_set_value(bar, new_value, LV_ANIM_ON/OFF)`.

source: A parameter called ``void * user_data`` is provided to the registration function as the **last** argument
it_it: Un parametro chiamato ``void * user_data`` viene fornito alla funzione di registrazione come **ultimo** argomento

source: A patch file is available in LVGL under: ``/env_support/esp/rlottie/0001-changes-to-compile-with-esp-idf.patch``
it_it: Un file di patch è disponibile in LVGL in: ``/env_support/esp/rlottie/0001-changes-to-compile-with-esp-idf.patch``

source: A pixel-perfect preview shows the UI as you type the XMLs.
it_it: Un'anteprima pixel-perfect mostra l'interfaccia utente mentre si digitano i file XML.

source: A pointer (for touch or mouse)
it_it: Un puntatore (per touch o mouse)

source: A pointer to that struct is provided as the **first** argument of a callback registration function.
it_it: Un puntatore a tale struttura viene fornito come **primo** argomento di una funzione di registrazione della callback.

source: A pointer to that struct is provided as the **first** argument of the callback itself.
it_it: Un puntatore a tale struttura viene fornito come **primo** argomento della callback stessa.

source: A pointer to the Widget's final class is passed in its ``class_p`` argument in case it is needed for determining the value for the ``id`` field, or for other possible needs related to your design for Widget IDs.
it_it: Un puntatore alla classe finale del Widget viene passato nell'argomento ``class_p`` nel caso in cui sia necessario per determinare il valore del campo ``id`` o per altre possibili esigenze relative alla progettazione degli ID Widget.

source: A pointer to the Y-value array of a series can be obtained with :cpp:expr:`lv_chart_get_series_y_array(chart, series)`.
it_it: Un puntatore all'array di valori Y di una serie può essere ottenuto con :cpp:expr:`lv_chart_get_series_y_array(chart, series)`.

source: A problem occurs when an allocated memory's pointer (return value of :cpp:func:`lv_malloc`) is stored only in either **global**, **static global** or **static local** pointer variable and not as part of a previously allocated ``struct`` or other variable.
it_it: Un problema si verifica quando un puntatore di memoria allocata (valore di ritorno di :cpp:func:`lv_malloc`) viene memorizzato solo in una variabile puntatore **global**, **static global** o **static local** e non come parte di una ``struct`` precedentemente allocata o di un'altra variabile.

source: A python3 interpreter if you wish to use KConfig.
it_it: Un interprete Python3 per utilizzare KConfig.

source: A ready-to-use LVGL project for VSCode is available at `https://github.com/lvgl/lv_port_pc_vscode <https://github.com/lvgl/lv_port_pc_vscode>`__.
it_it: Un progetto LVGL pronto all'uso per VSCode è disponibile all'indirizzo `https://github.com/lvgl/lv_port_pc_vscode <https://github.com/lvgl/lv_port_pc_vscode>`__.

source: A ready-to-use LVGL project for VSCode is available at https://github.com/lvgl/lv_port_pc_vscode\ .
it_it: Un progetto LVGL pronto all'uso per VSCode è disponibile all'indirizzo https://github.com/lvgl/lv_port_pc_vscode\ .

source: A round scale style simulating a Heart Rate monitor
it_it: Uno stile di scala circolare che simula un cardiofrequenzimetro

source: A round scale style simulating a compass
it_it: Uno stile di scala circolare che simula una bussola

source: A round scale style simulating a sunset/sunrise widget
it_it: Uno stile di scala circolare che simula un widget tramonto/alba

source: A round scale with labels rotated and translated
it_it: Una scala circolare con etichette ruotate e traslate

source: A round scale with multiple needles, resembling a clock
it_it: Una scala circolare con più lancette, simile a un orologio

source: A round scale with section and custom styling
it_it: Una scala circolare con sezione e stile personalizzato

source: A scale with section and custom styling
it_it: Una scala con sezione e stile personalizzato

source: A screen can be loaded like this: :cpp:expr:`lv_screen_load(my_screen)`
it_it: Uno screen può essere caricato in questo modo: :cpp:expr:`lv_screen_load(my_screen)`

source: A simple example
it_it: Un semplice esempio

source: A simple grid
it_it: Una semplice grid

source: A simple horizontal scale
it_it: Una semplice scala orizzontale

source: A simple round scale
it_it: Una semplice scala circolare

source: A simple row and a column layout with flexbox
it_it: Un semplice layout di riga e colonna con flexbox

source: A skeleton ``CMakeLists.txt`` file is generated which can be easily integrated into any project.
it_it: Viene generato un scheletro di file ``CMakeLists.txt`` facilmente integrabile in qualsiasi progetto.

source: A standard XML syntax is used.
it_it: Viene utilizzata una sintassi XML standard.

source: A stride of 0 is the default.
it_it: Il valore di default è "stride 0".

source: A style can be added to any state or state combination.
it_it: È possibile aggiungere uno stile a qualsiasi stato o combinazione di stati.

source: A style on its own has no effect until it is added (assigned) to a Widget.
it_it: Uno stile di per sé non ha effetto finché non viene aggiunto (assegnato) a un Widget.

source: A style property, for example ``"bg_opa"`` meaning :cpp:enumerator:`LV_STYLE_BG_OPA`.
it_it: Una proprietà di stile, ad esempio ``"bg_opa"`` che significa :cpp:enumerator:`LV_STYLE_BG_OPA`.
